In [3]:
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('seaborn')
import pandas as pd
import pydst
dst = pydst.Dst(lang='en')

In [4]:
#Ultimately, we want to look at the share of people who have a bachelor's degree or higher across municipalities and time
#So we want the table HFUDD10
dst.get_data(table_id = 'HFUDD10')

        BOPOMR HERKOMST  HFUDD       ALDER    KØN   TID  INDHOLD
0  All Denmark    Total  Total  Age, total  Total  2006  3833359

In [5]:
#Now, we take a look at the variabels
hfudd_var = dst.get_variables(table_id='HFUDD10')
hfudd_var

,id,text,elimination,time,map,values
0,BOPOMR,region,True,False,denmark_municipality_07,"[{'id': '000', 'text': 'All Denmark'}, {'id': ..."
1,HERKOMST,ancestry,True,False,NaN,"[{'id': 'TOT', 'text': 'Total'}, {'id': '5', '..."
2,HFUDD,highest education completed,True,False,NaN,"[{'id': 'TOT', 'text': 'Total'}, {'id': 'H10',..."
3,ALDER,age,True,False,NaN,"[{'id': 'TOT', 'text': 'Age, total'}, {'id': '..."
4,KØN,sex,True,False,NaN,"[{'id': 'TOT', 'text': 'Total'}, {'id': 'M', '..."
5,Tid,time,False,True,NaN,"[{'id': '2006', 'text': '2006'}, {'id': '2007'..."

In [6]:
#Next, look at the dictionary under values, to see the categories in order to specify what variables we need
udd = hfudd_var.loc[2,'values']
udd

[{'id': 'TOT', 'text': 'Total'},
 {'id': 'H10', 'text': 'H10 Primary education'},
 {'id': 'H1001', 'text': 'H1001 No education'},
 {'id': 'H1010', 'text': 'H1010 Primary school through to 6th grade'},
 {'id': 'H1020', 'text': 'H1020 Primary school 7th-9th grade'},
 {'id': 'H1030', 'text': 'H1030 Primary school 10th grade'},
 {'id': 'H20', 'text': 'H20 Upper secondary education'},
 {'id': 'H2010',
  'text': 'H2010 Upper secondary education, General (stx, hf, student courses)'},
 {'id': 'H2020',
  'text': 'H2020 Upper secondary education, General (hhx, htx)'},
 {'id': 'H2030', 'text': 'H2030 International upper secondary education'},
 {'id': 'H30', 'text': 'H30 Vocational Education and Training (VET)'},
 {'id': 'H3010', 'text': 'H3010 Care, health and education (OSP)'},
 {'id': 'H3015',
  'text': 'H3015 Office, commercial and business services (KHF)'},
 {'id': 'H3020', 'text': 'H3020 Food etc. (FJO)'},
 {'id': 'H3025', 'text': 'H3025 Agriculture and nature (FJO)'},
 {'id': 'H3030', 'text': 'H3030 Experience and events (FJO)'},
 {'id': 'H3035', 'text': 'H3035 Construction (TBT)'},
 {'id': 'H3040',
  'text': 'H3040 The technology area, power and electronics etc. (TBT)'},
 {'id': 'H3045',
  'text': 'H3045 The technology area, graphical techniques and media production (TBT)'},
 {'id': 'H3050',
  'text': 'H3050 The technology area, cycling, automotive and marine mechanics etc. (TBT)'},
 {'id': 'H3055',
  'text': 'H3055 The technology area, mechanical engineering and production (TBT)'},
 {'id': 'H3060',
  'text': 'H3060 Technical and industrial education in general (TBT)'},
 {'id': 'H3065', 'text': 'H3065 Transport and logistics (TBT)'},
 {'id': 'H3090', 'text': 'H3090 Other vocational educations'},
 {'id': 'H3097',
  'text': 'H3097 H3097 Vocational education not specified, VET'},
 {'id': 'H35', 'text': 'H35 Qualifying educational programmes'},
 {'id': 'H3510', 'text': 'H3510 Access courses - higher edu.'},
 {'id': 'H3520', 'text': 'H3520 Access Exams - engineering education'},
 {'id': 'H3530', 'text': 'H3530 Qualifying workshop schooling'},
 {'id': 'H40', 'text': 'H40 Short cycle higher education'},
 {'id': 'H4020', 'text': 'H4020 Educational, SCE'},
 {'id': 'H4024', 'text': 'H4024 Media and Communication, SCE'},
 {'id': 'H4025', 'text': 'H4025 Humanities and theological, SCE'},
 {'id': 'H4030', 'text': 'H4030 Arts, SCE'},
 {'id': 'H4038', 'text': 'H4038 Social science, Economics-Mercantile, SCE'},
 {'id': 'H4058', 'text': 'H4058 Technical educations, SCE'},
 {'id': 'H4075',
  'text': 'H4075 Food, biotechnology and laboratory technology, SCE'},
 {'id': 'H4080', 'text': 'H4080 Agriculture, nature and environment, SCE'},
 {'id': 'H4085', 'text': 'H4085 Maritime, SCE'},
 {'id': 'H4089', 'text': 'H4089 Health, SCE'},
 {'id': 'H4095', 'text': 'H4095 Police, armed forces etc., SCE'},
 {'id': 'H4097', 'text': 'H4097 Higher education not specified, SCE'},
 {'id': 'H50', 'text': 'H50 Vocational bachelors educations'},
 {'id': 'H5020', 'text': 'H5020 Educational, VBE'},
 {'id': 'H5024', 'text': 'H5024 Media and Communication, VBE'},
 {'id': 'H5025', 'text': 'H5025 Humanities and theological, VBE'},
 {'id': 'H5030', 'text': 'H5030 Arts, VBE'},
 {'id': 'H5038', 'text': 'H5038 Social science, Economics-Mercantile, VBE'},
 {'id': 'H5039', 'text': 'H5039 Social Sciences, VBE'},
 {'id': 'H5058', 'text': 'H5058 Technical educations, VBE'},
 {'id': 'H5059', 'text': 'H5059 Technical sciences, VBE'},
 {'id': 'H5075',
  'text': 'H5075 Food, biotechnology and laboratory technology, VBE'},
 {'id': 'H5080', 'text': 'H5080 Agriculture, nature and environment, VBE'},
 {'id': 'H5085', 'text': 'H5085 Maritime, VBE'},
 {'id': 'H5089', 'text': 'H5089 Health, VBE'},
 {'id': 'H5095', 'text': 'H5095 Police, armed forces etc., VBE'},
 {'id': 'H5097', 'text': 'H5097 Higher education not specified, VBE'},
 {'id': 'H60', 'text': 'H60 Bachelors programmes'},
 {'id': 'H6020', 'text': 'H6020 Educational, BACH'},
 {'id': 'H6025', 'text': 'H6025 Humanities and theological, BACH'},
 {'id': 'H6030', 'text': 'H6030 Arts, BACH'},
 {'id': 'H6035', 'text': 'H6035 Science, BACH'},
 {'id': 'H6039', 'text': 'H6039 Social Sciences, BACH'},
 {'id': 'H6059', 'text': 'H6059 Technical sciences, BACH'},
 {'id': 'H6075',
  'text': 'H6075 Food, biotechnology and laboratory technology, BACH'},
 {'id': 'H6080', 'text': 'H6080 Agriculture, nature and environment, BACH'},
 {'id': 'H6090', 'text': 'H6090 Health science, BACH'},
 {'id': 'H6097', 'text': 'H6097 Higher education not specified, BACH'},
 {'id': 'H70', 'text': 'H70 Masters programmes'},
 {'id': 'H7020', 'text': 'H7020 Educational, MASTER'},
 {'id': 'H7025', 'text': 'H7025 Humanities and theological, MASTER'},
 {'id': 'H7030', 'text': 'H7030 Arts, MASTER'},
 {'id': 'H7035', 'text': 'H7035 Science, MASTER'},
 {'id': 'H7039', 'text': 'H7039 Social Sciences, MASTER'},
 {'id': 'H7059', 'text': 'H7059 Technical sciences, MASTER'},
 {'id': 'H7075',
  'text': 'H7075 Food, biotechnology and laboratory technology, MASTER'},
 {'id': 'H7080', 'text': 'H7080 Agriculture, nature and environment, MASTER'},
 {'id': 'H7090', 'text': 'H7090 Health science, MASTER'},
 {'id': 'H7095', 'text': 'H7095 Police, armed forces etc., MASTER'},
 {'id': 'H7097', 'text': 'H7097 Higher education not specified, MASTER'},
 {'id': 'H80', 'text': 'H80 PhD programmes'},
 {'id': 'H8020', 'text': 'H8020 Educational, PhD'},
 {'id': 'H8025', 'text': 'H8025 Humanities and theological PhD'},
 {'id': 'H8030', 'text': 'H8030 Arts, PhD'},
 {'id': 'H8035', 'text': 'H8035 Science, PhD'},
 {'id': 'H8039', 'text': 'H8039 Social Sciences, PhD'},
 {'id': 'H8059', 'text': 'H8059 Technical sciences, PhD'},
 {'id': 'H8080', 'text': 'H8080 PhD programmes'},
 {'id': 'H8090', 'text': 'H8090 Health science, PhD'},
 {'id': 'H8097', 'text': 'H8097 Higher education not specified, PhD'},
 {'id': 'H90', 'text': 'H90 Not stated'},
 {'id': 'H9099', 'text': 'H9099 Not stated'}]

In [7]:
#First, we create list of the main categories
# Next we pick them from the HFUDD10 table and put into the dataframe hfudd10
hfudd_list = ['TOT','H60','H70','H80']
hfudd10 = dst.get_data(table_id = 'HFUDD10', variables={'BOPOMR':['*'], 'HFUDD':hfudd_list, 'TID':['*']})
hfudd10.tail()

,BOPOMR,HFUDD,TID,HERKOMST,ALDER,KØN,INDHOLD
5839,Vesthimmerlands,H60 Bachelors programmes,2019,Total,"Age, total",Total,125
5840,Mariagerfjord,H80 PhD programmes,2019,Total,"Age, total",Total,65
5841,Vesthimmerlands,H70 Masters programmes,2019,Total,"Age, total",Total,767
5842,Vesthimmerlands,H80 PhD programmes,2019,Total,"Age, total",Total,43
5843,Mariagerfjord,Total,2019,Total,"Age, total",Total,28720

In [8]:
#Drop unnecessary columns
hfudd10.drop(['ALDER','HERKOMST','KØN'], axis=1, inplace=True)

In [10]:
#Delete all rows that is not a municipality in the residence column
for val in ['Region', 'Province', 'All Denmark']: 
    I = hfudd10.BOPOMR.str.contains(val)
    hfudd10 = hfudd10.loc[I == False]

In [11]:
#Select all of the higher education categories sum them across each municipality and year.
group = hfudd10.loc[(hfudd10['HFUDD'] != 'Total')].copy()
group1 = group.groupby(['BOPOMR', 'TID'])['INDHOLD'].sum()
group2 = pd.DataFrame(group1)
group2.rename(columns = {'INDHOLD':'HIGH_EDU'}, inplace=True) #Rename column

In [18]:
#Select the total in each municipality and year.
total = hfudd10.loc[(hfudd10['HFUDD'] == 'Total')].copy()
total1 = total.groupby(['BOPOMR', 'TID'])['INDHOLD'].sum()
total2 = pd.DataFrame(total1)
total2.rename(columns = {'INDHOLD':'TOTAL_EDU'}, inplace=True) #Rename column

In [19]:
#Merge the data, reset index and get some proper variable names
merge = pd.merge(group2,total2,how='left',on=['BOPOMR','TID'])
merge['HIGH_EDU_SHARE'] = merge['HIGH_EDU'] / merge['TOTAL_EDU'] * 100
merge.reset_index(inplace=True)
merge.rename(columns = {'BOPOMR':'MUNICIPALITY','TID':'YEAR'}, inplace=True) #Rename column
merge

     MUNICIPALITY  YEAR  HIGH_EDU  TOTAL_EDU  HIGH_EDU_SHARE
0        Aabenraa  2006      1322      41865        3.157769
1        Aabenraa  2007      1367      41938        3.259574
2        Aabenraa  2008      1449      42097        3.442051
3        Aabenraa  2009      1498      42255        3.545143
4        Aabenraa  2010      1515      41920        3.614027
...           ...   ...       ...        ...             ...
1381          Ærø  2015       195       4119        4.734159
1382          Ærø  2016       205       4089        5.013451
1383          Ærø  2017       211       3937        5.359411
1384          Ærø  2018       230       3887        5.917160
1385          Ærø  2019       226       3766        6.001062

[1386 rows x 5 columns]

In [22]:
#Ultimately, we want to look at the share of people who have a bachelor's degree or higher across municipalities and time
#So we want the table HFUDD10
dst.get_data(table_id = 'HFUDD10')

#Now, we take a look at the variabels
hfudd_var = dst.get_variables(table_id='HFUDD10')
hfudd_var

#Next, look at the dictionary under values, to see the categories in order to specify what variables we need
udd = hfudd_var.loc[2,'values']
udd

#First, we create a list of the main categories i.e. education level higher or equal to bachelor
# Next we pick them from the HFUDD10 table and put into the dataframe hfudd10
hfudd_list = ['TOT','H60','H70','H80']
hfudd10 = dst.get_data(table_id = 'HFUDD10', variables={'BOPOMR':['*'], 'HFUDD':hfudd_list, 'TID':['*']})
hfudd10.tail()

#Drop unnecessary columns
hfudd10.drop(['ALDER','HERKOMST','KØN'], axis=1, inplace=True)

#Delete all rows that is not a municipality in the residence column
for val in ['Region', 'Province', 'All Denmark']: 
    I = hfudd10.BOPOMR.str.contains(val)
    hfudd10 = hfudd10.loc[I == False]
    
#Select all of the higher education categories sum them across each municipality and year.
group = hfudd10.loc[(hfudd10['HFUDD'] != 'Total')].copy()
group1 = group.groupby(['BOPOMR', 'TID'])['INDHOLD'].sum()
group2 = pd.DataFrame(group1)
group2.rename(columns = {'INDHOLD':'HIGH_EDU'}, inplace=True) #Rename column

#Select the total in each municipality and year.
total = hfudd10.loc[(hfudd10['HFUDD'] == 'Total')].copy()
total1 = total.groupby(['BOPOMR', 'TID'])['INDHOLD'].sum()
total2 = pd.DataFrame(total1)
total2.rename(columns = {'INDHOLD':'TOTAL'}, inplace=True) #Rename column

#Merge the data, reset index and get some proper variable names
merge = pd.merge(group2,total2,how='left',on=['BOPOMR','TID'])
merge['HIGH_EDU_SHARE'] = merge['HIGH_EDU'] / merge['TOTAL'] * 100
merge.reset_index(inplace=True)
merge.rename(columns = {'BOPOMR':'MUNICIPALITY','TID':'YEAR'}, inplace=True) #Rename column
merge

     MUNICIPALITY  YEAR  HIGH_EDU  TOTAL  HIGH_EDU_SHARE
0        Aabenraa  2006      1322  41865        3.157769
1        Aabenraa  2007      1367  41938        3.259574
2        Aabenraa  2008      1449  42097        3.442051
3        Aabenraa  2009      1498  42255        3.545143
4        Aabenraa  2010      1515  41920        3.614027
...           ...   ...       ...    ...             ...
1381          Ærø  2015       195   4119        4.734159
1382          Ærø  2016       205   4089        5.013451
1383          Ærø  2017       211   3937        5.359411
1384          Ærø  2018       230   3887        5.917160
1385          Ærø  2019       226   3766        6.001062

[1386 rows x 5 columns]